// Первое задание

var temperatureC = prompt('Введите температуру в градусах Цельсия:');
var temperatureF = (9 / 5) * temperatureC + 32;
alert(temperatureC + ' градуса по Цельсию равны ' + temperatureF + ' градусам по Фаренгейту');

// Второе задание

var admin;
var name;
name = 'Василий';
admin = name;
alert(admin);

// Третье задание

alert('Результат сложения цифры 1000 и строки 108 выдаст результат ' + 1000 + '108'); // результат 1000108

// Четвертое задание

var async = 'атрибут async загружает скрипт асинхронно';
var defer = 'атрибут defer откладывает выполнение крипта до тех пор, пока вся страница не будет загружена';

alert(async);
alert(defer);